podonoghue/usbdm-eclipse-plugins/net.sourceforge.usbdm.peripherals.freescale/data/peripherals/ADC0_MKE14D7.svd.xml
<!--
Devices using this peripheral: 
      MKE14D7
      MKE15D7
-->
      <peripheral>
         <?sourceFile "ADC0_MKE14D7" ?>
         <name>ADC0</name>
         <description>Analog-to-digital converter</description>
         <groupName>ADC</groupName>
         <prependToName>ADC0_</prependToName>
         <headerStructName>ADC</headerStructName>
         <baseAddress>0x4003B000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x10</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>SC1</name>
               <description>Status and Control Register 1</description>
               <addressOffset>0x0</addressOffset>
               <size>16</size>
               <resetValue>0x1F</resetValue>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>ADCH</name>
                     <description>Input Channel Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00000</name>
                           <description>AD0</description>
                           <value>0b00000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>00001</name>
                           <description>AD1</description>
                           <value>0b00001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>00010</name>
                           <description>AD2</description>
                           <value>0b00010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>00011</name>
                           <description>AD3</description>
                           <value>0b00011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>00100</name>
                           <description>AD4</description>
                           <value>0b00100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>00101</name>
                           <description>AD5</description>
                           <value>0b00101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>00110</name>
                           <description>AD6</description>
                           <value>0b00110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>00111</name>
                           <description>AD7</description>
                           <value>0b00111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01000</name>
                           <description>AD8</description>
                           <value>0b01000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01001</name>
                           <description>AD9</description>
                           <value>0b01001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01010</name>
                           <description>AD10</description>
                           <value>0b01010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01011</name>
                           <description>AD11</description>
                           <value>0b01011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11111</name>
                           <description>Module disabled Reset FIFO in FIFO mode</description>
                           <value>0b11111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADCO</name>
                     <description>Continuous Conversion Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>One conversion following a write to the ADC_SC1 when software triggered operation is selected, or one conversion following assertion of ADHWT when hardware triggered operation is selected. When the FIFO function is enabled (AFDEP &gt; 0), a set of conversion are triggered when ADC_SC2[ADTRG]=0 or both ADC_SC2[ADTRG]=1 and ADC_SC4[HTRGME]=1</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Continuous conversions initiated following a write to ADCSC1 when software triggered operation is selected. Continuous conversions are initiated by an ADHWT event when hardware triggered operation is selected. When the FIFO function is enabled (AFDEP &gt; 0), a set of conversions are loop triggered</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>AIEN</name>
                     <description>Interrupt Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Conversion complete interrupt disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Conversion complete interrupt enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>COCO</name>
                     <description>Conversion Complete Flag</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Conversion not completed</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Conversion completed</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SC2</name>
               <description>Status and Control Register 2</description>
               <addressOffset>0x2</addressOffset>
               <size>16</size>
               <resetValue>0x8</resetValue>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>FFULL</name>
                     <description>Result FIFO full</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Indicates that ADC result FIFO is not full and next conversion data still can be stored into FIFO</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Indicates that ADC result FIFO is full and next conversion will override old data if no read action</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FEMPTY</name>
                     <description>Result FIFO empty</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Indicates that ADC result FIFO have at least one valid new data</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Indicates that ADC result FIFO have no valid new data</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ACDSEL</name>
                     <description>Compare Data Selection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Compare value is from the conversion result and ADC_CVA</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Compare value is from the conversion result and ADC_CVB</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ACFE</name>
                     <description>Compare Function Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Compare function disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Compare function enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADTRG</name>
                     <description>Conversion Trigger Select</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Software trigger selected</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Hardware trigger selected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADACT</name>
                     <description>Conversion Active</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Conversion not in progress</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Conversion in progress</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SC3</name>
               <description>Status and Control Register 3</description>
               <addressOffset>0x4</addressOffset>
               <size>16</size>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>ADICLK</name>
                     <description>Input Clock Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>Bus clock</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Bus clock divided by 2</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Alternate clock (ALTCLK)</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Asynchronous clock (ADACK)</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MODE</name>
                     <description>Conversion Mode Selection</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>8-bit conversion (N=8)</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>10-bit conversion (N=10)</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>12-bit conversion (N=12)</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Reserved</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADLSMP</name>
                     <description>Long Sample Time Configuration</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Short sample time</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Long sample time</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADIV</name>
                     <description>Clock Divide Select</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>Divide ration = 1, and clock rate = Input clock</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Divide ration = 2, and clock rate = Input clock * 2</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Divide ration = 3, and clock rate = Input clock * 4</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Divide ration = 4, and clock rate = Input clock * 8</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADLPC</name>
                     <description>Low-Power Configuration</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>High speed configuration</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Low power configuration:The power is reduced at the expense of maximum clock speed</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
